In [1]:
import pandas as pd

In [3]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Display Top 3 Rows of the dataset

In [10]:
df1.head(3) # default it shows 5 top rows

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## 2. Check Last 3 rows of the dataset

In [13]:
df1.tail(3) # default it shows 5 last rows

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 3. Find Shape of Our Dataset(Number of Rows & Number of Columns)

In [16]:
df1.shape # it returns a tuple (index 0 and index 1)

(7, 3)

In [18]:
print('Number of rows: ', df1.shape[0])

Number of rows 7

In [20]:
print('Number of columns: ', df1.shape[1])

Number of columns:  3

## 4. Get information about our dataset like total number of rows, total number of columns, datatypes of each column and memory requirement

In [23]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

## 5. check Null Values in the dataset

In [30]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [59]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [61]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

## 6. Get Overall Statistics About the DataFrame

In [41]:
df1.describe()

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [57]:
 df1.describe(include = "all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

## 7. Find Unique Values From The Gender Column

In [44]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## 8. Find The number of unique values from the Gender column

In [49]:
df1['Gender'].nunique()

2

## 9. Display Count of Unique Values in Gender Column

In [55]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

## 10. Find Total Number of Students having marks between 90 to 100(inclusive) using between method

In [65]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [67]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [73]:
(df1['Marks']>=90) & (df1['Marks'] <=100) #  For 2 or more conditions we have to write each condition in brackets

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [75]:
df1[(df1['Marks']>=90) & (df1['Marks'] <=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [77]:
len(df1[(df1['Marks']>=90) & (df1['Marks'] <=100)])

4

In [81]:
df1['Marks'].between(90, 100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [83]:
sum(df1['Marks'].between(90, 100))

4

## 11. Find Average Marks

In [86]:
df1["Marks"].mean()

92.14285714285714

In [88]:
df1["Marks"].min()

83

In [90]:
df1["Marks"].max()

99

## 12. Apply method

In [105]:
def marks(x):
    return x//2 # float division
    # return x/2 normal division

In [107]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

## Adding a new column into the Dataset

In [110]:
df1['Half_marks'] = df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [112]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [114]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## 13. Map Function

In [118]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [122]:
df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})

In [124]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

## 14. Drop the columns

In [127]:
df1.drop('Male_Female', axis = 1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [135]:
## to drop multiple columns, you should use python list
df1.drop(['Male_Female', 'Half_marks'], axis = 1, inplace = True )
## 'inplace = True' modifies existing dataframe
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 15. Print Name of Columns

In [138]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [140]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## 16. Sort the Dateframe as per The Marks Column

In [144]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [150]:
df1.sort_values(by='Marks')
# df1.sort_values(by='Marks', ascending = False)  To sort values in Descending order

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

## 17. Display Name & Marks of the female Students

In [153]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [159]:
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [161]:
df1[df1['Gender'].isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [167]:
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99